results/nginx/c5n.xlarge/run1.log
===== Nginx Benchmark: c5n.xlarge =====
Timestamp: 2026-01-16T13:18:03+00:00

=== Warm-up (10s) ===
=== wrk Test (2 threads, 100 connections, 30s) ===
Running 30s test @ http://nginx-server-c5n-xlarge/
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.16ms  417.78us  18.74ms   83.26%
    Req/Sec    43.31k     2.44k   47.64k    66.00%
  2585187 requests in 30.09s, 1.18GB read
Requests/sec:  85911.62
Transfer/sec:     40.06MB

=== wrk Test (4 threads, 200 connections, 30s) ===
Running 30s test @ http://nginx-server-c5n-xlarge/
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.21ms    1.09ms  27.58ms   72.80%
    Req/Sec    23.05k     1.19k   26.48k    73.91%
  2743171 requests in 30.06s, 1.25GB read
Requests/sec:  91244.25
Transfer/sec:     42.55MB

=== wrk Test (8 threads, 400 connections, 30s) ===
Running 30s test @ http://nginx-server-c5n-xlarge/
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.36ms  749.42us  34.80ms   97.41%
    Req/Sec    11.56k   748.58    31.98k    95.96%
  2763240 requests in 30.10s, 1.26GB read
Requests/sec:  91801.77
Transfer/sec:     42.81MB

===== Complete =====